[
  {
    "content": "Open Playstore Search for Google Chrome on Playstore Update Google Chrome or your default browser to the latest version The chart should load successfully now If the chart loading fails & issue still exists : Open Playstore again Search for Android System Webview Click to Update the Android System Webview to the latest version",
    "metadata": {
      "source_url": "https://www.angelone.in/support/charts",
      "source_filename": "support_charts",
      "page_title": "Chart Not Loading: Troubleshoot Chart Issues | Angel One",
      "section_title": "Chart not Loading",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Market surveillance plays a key role in ensuring safety and integrity of the markets as it the process of prevention and investigation of abusive, manipulative or illegal trading practices in the securities markets. Surveillance Measure is an initative by the regulatory bodies and exchanges to protect traders and investors by monitoring price and volatility and detecting misleading activities like insider trading, fictitious transactions, and more.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/complaince",
      "source_filename": "support_complaince",
      "page_title": "Guide on Trading and Surveillance Compliance | Angel One",
      "section_title": "Trading & Surveillance",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "SEBI (Securities and Exchange Board of India) along with the stock exchanges have initiated an Additional Surveillance Measure or ASM to safeguard investors’ interests by ensuring there are no market speculations or manipulations like unexpected price movements. The stocks are categorized under ASM for surveillance based on criteria specified by NSE here.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/complaince",
      "source_filename": "support_complaince",
      "page_title": "Guide on Trading and Surveillance Compliance | Angel One",
      "section_title": "Trading & Surveillance",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "GSM or Graded Surveillance Measure is a system used by Indian Stock Exchanges like NSE and BSE to alert traders/investors and ask them to be extra cautious while dealing in certain securities which have been categorized under GSM. Scrips can be classified under GSM due to abnormal price hike that doesn’t match with the company’s financial health, are illiquid, have negligible market capital, and are underpreforming.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/complaince",
      "source_filename": "support_complaince",
      "page_title": "Guide on Trading and Surveillance Compliance | Angel One",
      "section_title": "Trading & Surveillance",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The main aim of the ASM framework is to control stock volatility, while the primary objective of GSM is to protect the investors from underperforming stocks by not allowing intraday trading and to advise them to be extra vigilant while dealing with securities that are witnessing unusual price fluctuations. Both these frameworks are introduced with different objectives, but their main goal is to protect traders and investors.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/complaince",
      "source_filename": "support_complaince",
      "page_title": "Guide on Trading and Surveillance Compliance | Angel One",
      "section_title": "Trading & Surveillance",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "On the basis of below-mentioned pointers, Regulatory Body and the Exchanges make their decision of adding a scrip under GSM category: 1. Periodic Call Auction Session for Illiquid Securities 2. Periodic Review of Movement of Securities to/from Trade for Trade 3. Persistent Noise Creators 4. Rumour Verification and Clarification in case of Spurt in Price/Volume",
    "metadata": {
      "source_url": "https://www.angelone.in/support/complaince",
      "source_filename": "support_complaince",
      "page_title": "Guide on Trading and Surveillance Compliance | Angel One",
      "section_title": "Trading & Surveillance",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Your money is deducted before video KYC as it is the last step to verify your identity and book your FD. Your money is safe with the bank, and interest starts accumulating from the time of payment. In case of issues with VKYC, your money will be refunded within 7 working days.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/fixed-deposits",
      "source_filename": "support_fixed-deposits",
      "page_title": "Account Verification - Angel One",
      "section_title": "Account Verification",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Download the Google Pay/ PhonePe / BHIM App Verify your mobile number Register the passcode (it is required to open the app) Select your bank from the options available The app will fetch your bank details In case you have more than one account, choose the account you want to register with BHIM Set up a UPI PIN for security Now you can check your UPI ID in the profile section.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "In case you can’t find your UPI Handle in the dropdown list on the IPO page in the Angel One app, it means your UPI Handle is not approved by NPCI for applying for an IPO. Try to use or create an alternative UPI ID with any of the entities featured on the NPCI list.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Go to your Payment App – Navigate to the mandate section and check if you have an open mandate or not. In case you have received many mandates then you can cross verify with the Application ID mentioned in the mandate details with the Application ID mentioned in the order details from Angel One’s Application OR Make sure your Payments App is updated. OR If it is taking longer than 6 hours then cancel your bid from Angel one’s application and place a new bid.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Cut-off price is the price at which the shares get issued through an IPO to the investors. This price is ascertained at the allotment stage. When an investor applies for an IPO at a cut-off price, that means he is ready to bid at this price. In an ideal scenario, all retail investors bid at the cut-off price to increase their chance of allotment.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Once the shares are allotted to you, the amount will be debited from your bank account. If the shares are not allotted to you, the amount will be unblocked/released to your account on/before the UPI mandate expiry date. Note: Banks usually take 10-15 days to release your funds. If your funds are still blocked after 15 days please contact your bank .",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Yes, you can modify the lot size and UPI ID of your IPO bid after placing an order. Please note that if you have approved your UPI mandate request for the order and modified the order later, the entire IPO bid amount will be blocked in addition to the amount blocked for your original IPO bid. You will also receive another UPI mandate request for your modified bid. However, if you haven’t approved the original mandate request, no amount will be blocked for the original IPO bid.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "For example: Jack is using Jill’s UPI ID to apply for an IPO with his Demat A/c. In such a case, Jack’s application will be rejected because Jill’s bank account used is not linked to the demat account of Jack Jill’s UPI ID used is not linked to Jack’s PAN",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Your funds will be blocked once you approve the UPI mandate request for IPO. Your funds will be unblocked/released on or before the UPI mandate expiry date if the shares are not allotted through IPO. Please reach out to your bank in case funds are not unblocked/released post the mandate expiry date.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Rejection – Application can be rejected due to either of the following reasons: 1) Application received from multiple Demat accounts having the same PAN 2) Bank account Demat account, and UPI ID used for an application not mapped to the same PAN 3) Your bid price is lower than the final issue price",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Only 1 application per PAN is recommended. Even if you apply via different platforms using the same PAN, your application will be rejected and you will not get the IPO allotment. However, you can increase the chances of IPO allotment by applying with different account linked to different PAN. For example, you can apply with your and your parents demat account separately.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs",
      "source_filename": "support_ipo-ofs",
      "page_title": "Assistance for IPO Application Process, Allotment Status | Angel One",
      "section_title": "IPO",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Payments made via Netbanking generally result in next working day’s NAV. This happens as settlement to ICCL does not happen real time and generally takes places on ‘T+1’ basis. Angel One depends on payment aggregator for ICCL settlements. So even if order and payment is successful before cut-off, If the payment mode is netbanking, This might result in next day’s NAV.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/mutual-funds",
      "source_filename": "support_mutual-funds",
      "page_title": "Mutual Fund Orders with Angel One: Guide on Tracking MF Orders?",
      "section_title": "Orders",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The bonus shares will get credited to your demat account 10-15 days after the record date. In case you do not receive the same post 15 days from the Record date you can check the status with the Registrar (RTA). You can find the details of the Registrar on the BSE India website by visiting the Corp Information section.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/portfolio-and-corporate-actions",
      "source_filename": "support_portfolio-and-corporate-actions",
      "page_title": "Bonus Issues with Angel One: How to Manage Bonus Issues in Portfolio?",
      "section_title": "Bonus Issue",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The buy price of bonus shares is zero, as they are credited at no cost. When the shares are credited to your account, the quantity of shares increases while the invested value remains unaffected. As a result, the average price of the stock reduces. Be assured that it is correctly calculated by Angel One.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/portfolio-and-corporate-actions",
      "source_filename": "support_portfolio-and-corporate-actions",
      "page_title": "Bonus Issues with Angel One: How to Manage Bonus Issues in Portfolio?",
      "section_title": "Bonus Issue",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Similarly, if you want to place one unpledge request for 100 shares of ABC Ltd. and two unpledge requests for 50 shares and 20 shares of XYZ Ltd, respectively. In this case, you will be charged (₹20 x 3) = ₹60 + GST for 3 requests, irrespective of the number of shares in each request.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/charges-and-cashbacks/stock-pledging-charges",
      "source_filename": "support_charges-and-cashbacks_stock-pledging-charges",
      "page_title": "Guide on Charges for Stock Pledging and Unpledging at Angel One",
      "section_title": "Stock Pledging Charges",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "DP(Depository Participant) charges are applied at the time of selling shares from your DEMAT account. DP Charges are levied on a per-scrip, per-transaction basis. They don’t depend on the quantity of shares you sold, but on the number of different scrips/shares/securities that you sell. DP Charges are levied at Rs 20 (+ 18% GST) per scrip per transaction.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/charges-and-cashbacks/dp-depository-participant-charges",
      "source_filename": "support_charges-and-cashbacks_dp-depository-participant-charges",
      "page_title": "Explore the DP (Depository Participant) Charges in Angel One",
      "section_title": "DP (Depository Participant) Charges",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "1. Open the chart and check the price scale on the right-hand side of the chart. 2. Below it, you will find a settings icon (shaped like a sun). 3. Click this settings icon. 4. Thereafter, a menu with different options will appear. 5. Click on ‘Regular’ to bring the price scale back to the default setting.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/charts/others",
      "source_filename": "support_charts_others",
      "page_title": "Other Different Charts Interface Available on Angel One",
      "section_title": "Others",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Note: Please know that clients will not be able to buy stocks that are in stage 2 of GSM or higher. These stocks will require Additional Surveillance Deposit (ASD) of 100% of the trade value or more and this margin will remain blocked by the exchange atleast for 2 months even after the stock is solid.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/complaince/risk-management-asm-gsm",
      "source_filename": "support_complaince_risk-management-asm-gsm",
      "page_title": "Guide on Risk Management, ASM, GSM Compliance | Angel One",
      "section_title": "Risk Management – ASM & GSM",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Inter Creditor Agreement (ICA): An agreement between various lenders and a single borrower that describes their rights and obligations in case of a default is ICA. When a company has entered into ICA to restructure the debt, its stock comes under the surveillance. In these cases, trading in the stocks might be allowed but with certain restrictions in place.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/complaince/risk-management-asm-gsm",
      "source_filename": "support_complaince_risk-management-asm-gsm",
      "page_title": "Guide on Risk Management, ASM, GSM Compliance | Angel One",
      "section_title": "Risk Management – ASM & GSM",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "A fixed deposit (FD) is a popular and safe investment option in India. You invest a lump sum of money at an agreed interest rate and receive the amount along with interest upon maturity. The interest rates are fixed, higher than a regular savings account, and the investment is protected from market fluctuations.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/fixed-deposits/fixed-deposit-options",
      "source_filename": "support_fixed-deposits_fixed-deposit-options",
      "page_title": "Fixed Deposit Options - Angel One",
      "section_title": "Fixed Deposit Options",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Currently, we do not offer a solution to avoid TDS deduction. Some banks allow the filing of forms 15G/15H, but we do not have this functionality. TDS is deducted only if the total interest from all sources with the bank exceeds Rs 40,000 for normal citizens and Rs 50,000 for senior citizens.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/fixed-deposits/fixed-deposit-options",
      "source_filename": "support_fixed-deposits_fixed-deposit-options",
      "page_title": "Fixed Deposit Options - Angel One",
      "section_title": "Fixed Deposit Options",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Interest earnings from your fixed deposit are taxed according to your tax slab. For example, if you are in the 20% tax bracket and you earned Rs 6,000 interest from a 1-year FD of Rs 1 lakh at 6%, you will pay 20% of Rs 6,000, which is Rs 1,200, as tax.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/fixed-deposits/fixed-deposit-options",
      "source_filename": "support_fixed-deposits_fixed-deposit-options",
      "page_title": "Fixed Deposit Options - Angel One",
      "section_title": "Fixed Deposit Options",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Third-party limit error: Check your daily online transaction limit in your net banking, as exceeding this limit will cause the transaction to fail. UPI limit error: UPI transactions have a daily limit of Rs 1 lakh. Ensure you are not exceeding this limit. Bank connection error: Sometimes the connection to your bank’s page or UPI app page may break during payment, causing the transaction to fail.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/fixed-deposits/payments-and-withdrawal",
      "source_filename": "support_fixed-deposits_payments-and-withdrawal",
      "page_title": "Payments and Withdrawal - Angel One",
      "section_title": "Payments and Withdrawal",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "If your OFS bid has been accepted and you have been allotted shares, your account will be debited for the appropriate amount at End of Trading Day. Shares will be credited on the next T+2 days In case of oversubscription, shares will be allotted on a pro-rata basis You can also place a bid using the Margin available in your account. However, ensure you have sufficient Margin while making the bid. To find out your Margin, visit your Fund section on the Angel One app",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs/ofs",
      "source_filename": "support_ipo-ofs_ofs",
      "page_title": "How to Invest in Offer for Sale (OFS) through Angel One?",
      "section_title": "OFS",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The quantity of gold for which the investor pays is protected, since he receives the ongoing market price at the time of redemption/ premature redemption. No risks and costs of physical storage. No making charges and purity issues Earn interest at 2.5% per year on the initial investment.& Interest is credited twice a year.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs/sovereign-gold-bonds-sgb",
      "source_filename": "support_ipo-ofs_sovereign-gold-bonds-sgb",
      "page_title": "All You Need to Know About Sovereign Gold Bonds (SGB) In Angel One",
      "section_title": "Sovereign Gold Bonds (SGB)",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The Bonds are issued in denominations of one gram of gold and in multiples thereof. Minimum investment in the Bond shall be one gram with a maximum limit of subscription of 4 kg for individuals, 4 kg for Hindu Undivided Family (HUF) and 20 kg for trusts and similar entities notified by the government from time to time per fiscal year (April-March). In case of joint holding, the limit applies to the first applicant. The annual ceiling will include bonds subscribed under different tranches during initial issuance by Government and those purchased from the secondary market. The ceiling on investment will not include the holdings as collateral by banks and other Financial Institutions.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs/sovereign-gold-bonds-sgb",
      "source_filename": "support_ipo-ofs_sovereign-gold-bonds-sgb",
      "page_title": "All You Need to Know About Sovereign Gold Bonds (SGB) In Angel One",
      "section_title": "Sovereign Gold Bonds (SGB)",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The Bonds bear interest at the rate of 2.50% (fixed rate) per annum on the amount of initial investment. Interest will be credited semi-annually to the bank account of the investor and the last interest will be payable on maturity along with the principal. There will be no capital gain tax at maturity.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/ipo-ofs/sovereign-gold-bonds-sgb",
      "source_filename": "support_ipo-ofs_sovereign-gold-bonds-sgb",
      "page_title": "All You Need to Know About Sovereign Gold Bonds (SGB) In Angel One",
      "section_title": "Sovereign Gold Bonds (SGB)",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Tap on Account at the bottom of your page Scroll down to Stock Pledging & click on Pledge stocks Click on Increase & select the quantity & shares you wish to pledge Click on Increase Margin Enter OTP by Angel One You will be redirected to the CDSL website where you need to enter the OTP sent by CDSL on your registered mobile number Post entering the OTP click on Verify Once the pledge is approved, margins will be provided against the pledged stock within 15 minutes",
    "metadata": {
      "source_url": "https://www.angelone.in/support/margin-pledging-and-margin-trading-facility/margin-pledge-unpledge",
      "source_filename": "support_margin-pledging-and-margin-trading-facility_margin-pledge-unpledge",
      "page_title": "How to Pledge and Unpledge securities for Margin in Angel One?",
      "section_title": "Margin Pledge/Unpledge",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Margin Pledge means using your existing holdings / portfolio to get additional limit / margin. You can then use this additional margin for Equity Intraday, futures & options writing (equity and currency F&O). As per SEBI guidelines, shares bought under MTF have to be compulsorily pledged. This is called MTF pledge. Unlike Margin Pledge, you do not get additional limit against these shares.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/margin-pledging-and-margin-trading-facility/margin-trading-facility",
      "source_filename": "support_margin-pledging-and-margin-trading-facility_margin-trading-facility",
      "page_title": "Margin Trading Facility(MTF): Enhance Trading Potential with Angel One",
      "section_title": "Margin Trading Facility",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "For example, on June 3rd, you will see the Current Value for June 2nd. The Current Value for June 3rd will be updated later on June 3rd, after the market closes. Therefore, throughout June 3rd, you will view the Current value from June 2nd. On June 4th, you will see Current Value of June 3rd.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/mutual-funds/investments",
      "source_filename": "support_mutual-funds_investments",
      "page_title": "How to Track Mutual Fund Investment in Angel One?",
      "section_title": "Investments",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "For example, on June 3rd, you will see the NAV for June 2nd. The NAV for June 3rd will be updated later on June 3rd, after the market closes. Therefore, throughout June 3rd, you will view the NAV from June 2nd. On June 4th, you will see NAV of June 3rd.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/mutual-funds/investments",
      "source_filename": "support_mutual-funds_investments",
      "page_title": "How to Track Mutual Fund Investment in Angel One?",
      "section_title": "Investments",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "An unrealized gain/loss is the increase/decrease in the value of an asset or investment that an investor holds but has not yet sold for cash. It is called unrealized; gain/loss because the investor hasn’t booked the profit/loss until he actually sells that investment. A gain or loss becomes realized when the investment is actually sold.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/portfolio-and-corporate-actions/holdings-portfolio",
      "source_filename": "support_portfolio-and-corporate-actions_holdings-portfolio",
      "page_title": "Guid on Managing Your Holdings and Portfolio with Angel One",
      "section_title": "Holdings/Portfolio",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Follow the below path to sell shares in BSE Click on the share you wish to sell from your Portfolio & tap on Sell Click on 3 dots on the top right hand corner & change the Exchange from NSE to BSE or vice versa. Your share will now be sold on BSE",
    "metadata": {
      "source_url": "https://www.angelone.in/support/portfolio-and-corporate-actions/holdings-portfolio",
      "source_filename": "support_portfolio-and-corporate-actions_holdings-portfolio",
      "page_title": "Guid on Managing Your Holdings and Portfolio with Angel One",
      "section_title": "Holdings/Portfolio",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Investors can also view and download the Rights Issue Application Form (CAF), Offer Letter, Abridged Letter & Entitlement Ratio – Applicable only for registered holders with holdings as of Record Date, from the RTA website. RTA don’t directly accept Right Issue application forms (online/offline). Application needs to be channeled through SCSBs only.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/portfolio-and-corporate-actions/rights-issue",
      "source_filename": "support_portfolio-and-corporate-actions_rights-issue",
      "page_title": "Right Issue: Guidance on Applying for Right Issue | Angel One",
      "section_title": "Rights Issue",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "You will receive the Stock Split shares in 3-4 trading days after the record date. In case you do not receive the same post 5 days from the Record date you can check the status with the Registrar (RTA). You can find the details of the Registrar on the BSE India website by visiting the Corp Information section.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/portfolio-and-corporate-actions/stock-split",
      "source_filename": "support_portfolio-and-corporate-actions_stock-split",
      "page_title": "Stock Split: How to Manage Stock Splits? | Angel One",
      "section_title": "Stock Split",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "You will receive your user ID, also called as client ID within 3 working days. You can use the client ID to login to the Angel One app. Password is not required to login to your account. You will have to set up an MPIN while logging in for the first time.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-account/online-account-opening",
      "source_filename": "support_your-account_online-account-opening",
      "page_title": "How to Open Online Account with Angel One? Step-by-Step Guidance",
      "section_title": "Opening Your Account",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "A subscription plan is a tailored package designed for our clients that provides exclusive trading benefits. These benefits vary depending on the plan and include zero brokerage trades, reduced interest rates on Margin Trading Facility (MTF), and combination offers. Plans are purchased with an upfront payment and are valid for a predetermined period, with specific usage limits attached.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-account/subscription-plans",
      "source_filename": "support_your-account_subscription-plans",
      "page_title": "Angel One Account Subscription Plans: Guide on Purchase Plans",
      "section_title": "Subscription Plans",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "To purchase a subscription plan, navigate to Subscription Tab on Homepage or Account section then navigate to the ‘Discover Plans’ tab, select a plan to view its details, and click the ‘Buy’ button in the details page. After successful payment, the plan will be activated immediately during market hours or the next day if purchased after market hours.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-account/subscription-plans",
      "source_filename": "support_your-account_subscription-plans",
      "page_title": "Angel One Account Subscription Plans: Guide on Purchase Plans",
      "section_title": "Subscription Plans",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "If you are eligible for a refund, based on the usage of your plan benefits and the Terms and Conditions of the subscription, the refund will be processed directly into your trading balance. The refund amount will be determined by the extent of plan utilization at the time of cancellation.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-account/subscription-plans",
      "source_filename": "support_your-account_subscription-plans",
      "page_title": "Angel One Account Subscription Plans: Guide on Purchase Plans",
      "section_title": "Subscription Plans",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "We have partnered with Vested, a platfor that allows investing in US stock market. You can Vested on the Angel One home page. Scroll down to find External services. Here you will find an option to navigate to Vested. Completely your KYC with Vested to start investing in US stocks.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-account/other-services",
      "source_filename": "support_your-account_other-services",
      "page_title": "Explore Additional Services by Angel One: Enhance Trading Experience",
      "section_title": "Other Services",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "It could mean that for some reason, your signature could not be validated – it could be either because the signature itself was not valid or for some other reason. But not to worry! Our sales team will reach out to you shortly to help you resolve the issue and complete the KYC process.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-account/kyc-status",
      "source_filename": "support_your-account_kyc-status",
      "page_title": "Support on KYC Status with Angel One | Verify & Update Easily",
      "section_title": "KYC Queries",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "If you have saved your basket, then you can see it the next day, but the orders will be reset to the initial state i.e., before placing the Basket Order. However, you won’t be able to see the status of the orders. Please know that if you don’t manually save the basket, it will not appear in the Baskets Tab.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/basket-order",
      "source_filename": "support_your-orders_basket-order",
      "page_title": "Efficiently Manage and Track Your Basket Orders | Angel One",
      "section_title": "Basket Order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Disclosed quantity feature allows you to declare only a part of the actual order to the market that you want to buy/sell. Once you specify the disclosed quantity, the order is sent to the exchange and only the disclosed part is shown on the market screen. The disclosed quantity should neither be equal to or greater than the order quantity nor should it be less than 10% of the order quantity.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/placing-an-order",
      "source_filename": "support_your-orders_placing-an-order",
      "page_title": "Learn How to Place an Order in Angel One? Comprehensive Guide",
      "section_title": "Placing an Order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "A Robo order is a multi-leg order used in intraday trading which allows you to place 2 more orders along with the initial order. One order is placed at a price lower than order price and other placed at a price higher than order price. Order is automatically exited when any of the defined targets are met. These orders can be exited manually before hitting target or stop loss targets as well.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/robo-order",
      "source_filename": "support_your-orders_robo-order",
      "page_title": "Comprehensive Support for Robo Orders at Angel One",
      "section_title": "Robo order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Your buy/sell position might not be squared off due to upper/lower circuit in that stock. In case you have bought the stock and the share is in a lower circuit your shares will be sold the next day. In case you have short sold the share there is in upper circuit on the share the shares will be auctioned.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/square-off",
      "source_filename": "support_your-orders_square-off",
      "page_title": "Detailed Support for Square Off Orders | Angel One",
      "section_title": "Square Off",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "It may happen if you have a pending Stop-Loss (SL) or an exit order already. With an already pending stop-loss or exit order, you will need extra funds to be able to place a duplicate SL/exit order. If you do not have this extra fund in your account, then your duplicate exit order will get rejected. That’s why we inform you while exiting if there’s a Pending SL/exit order against a position, to avoid any duplicate orders and rejections.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The asset may be lacking a buyer/seller at the defined stop-loss limit price due to a lack of market depth. Orders are queued while they are being purchased or sold. a. For example: Let’s say there are 50 buyers and 100 sellers who are waiting to trade on a scrip at ₹90. Upon reaching ₹90, the first 50 sellers’ orders will be executed, and the remaining 50 sellers will have to wait for new buyers. In case you are one of those remaining 50 sellers, your sell order will remain pending if there are no corresponding buyers and vice versa.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "The price movement during high volatility does not fulfill certain criteria e.g. suppose you have placed a sell stop-loss with trigger Price at ₹100 and limit price at ₹100. Now imagine that the LTP touched ₹100 (here, the SL would be triggered) and quickly went below ₹100 due to high volatility. The limit price of ₹100 means the stop-loss order would get executed at only ₹100 or more. Now this order will be pending as price is below Rs 100 and execution will happen only when price has reached or crossed Rs 100. Hence your stop-loss order was not executed. Due to this reason, we recommend keeping a sufficient gap between the trigger price and limit price to increase the chances of Stop Loss execution during high volatility.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Note: In order to increase the chances of execution, we keep the default value of the limit price 2 ticks away from the trigger price. This is done so that if the LTP moves rapidly after triggering the order, the limit price shouldn’t be a hindrance and the order should still get executed. Also, if you change the pre-set limit price and bring it closer to the Trigger Price, the chances of execution can reduce in cases of volatility.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Chances are that the market price did hit the stop-loss price, albeit momentarily and without you being able to spot it at that moment. Within a second, prices can change multiple times and not all of them are relayed to the Brokers by Exchange, especially during high volatility. As a result, such momentary price fluctuations are not seen anywhere. Price matching and execution of the orders is done by the Exchanges and not the Broker.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Stop-loss is a tool that investors use to minimise the loss in a trade. Some traders define it as an advance order, which triggers an automatic closure of an open position when the stock price reaches the trigger price level. Stop loss helps minimise losses but also limit profits from a trade.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "A Trailing Stop-loss is an order that lets you set a maximum value or percentage of loss you can incur on a trade. If the securiy price rises or falls in your favour, the trigger price jumps with it at the set value or percentage. If the security price rises or falls against you, the trigger price stays in place depending on the nature of the order.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Stop-loss can be your real saviour during a volatile market condition. A price level set at the beginning of the trade allows traders to close their position automatically when the stop-loss is reached. Squaring off takes place at the next price available at the trigger price level and helps limit losses.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/stop-loss-order",
      "source_filename": "support_your-orders_stop-loss-order",
      "page_title": "Detailed Support for Stop Loss Orders | Angel One",
      "section_title": "Stop loss order",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "A stop-loss order is a buy/sell order that can help you limit your losses in case the prices move against your trade. If you are buying a stock, then you will have to add a sell stop-loss. If you have to sell a stock, then you will have to add a buy stop-loss.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/types-of-orders",
      "source_filename": "support_your-orders_types-of-orders",
      "page_title": "Types of Orders at Angel One - Detailed Support and Guidance",
      "section_title": "Types of Orders",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "GTT order allows you to place buy or sell orders at a predetermined price. These orders are executed if the market price of the stock reaches your specified price also called as Trigger Price before the GTT order expires. GTT Orders are valid for an year. If price is not reached within one year then order is cancelled",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/types-of-orders",
      "source_filename": "support_your-orders_types-of-orders",
      "page_title": "Types of Orders at Angel One - Detailed Support and Guidance",
      "section_title": "Types of Orders",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "Within a second multiple prices are received. Not all the price changes are shown on the application. It is possible that the price was breached but could not be shown on the application. This may have happened since you are able to see just one tick per second, you may not be able to see the price when the stop-loss limit is breached and the trade is executed.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/types-of-orders",
      "source_filename": "support_your-orders_types-of-orders",
      "page_title": "Types of Orders at Angel One - Detailed Support and Guidance",
      "section_title": "Types of Orders",
      "chunk_type": "paragraph"
    }
  },
  {
    "content": "It does not guarantee that your order will be executed even if your price has been reached. Orders are queued while being bought or sold. For Example. Assume you placed a Buy limit order of 100 Rs for the ABC script. Let’s say there are 100 buyers and 50 sellers waiting to trade in ABC at 100. ABC is currently trading at 105 Rs and after a few minutes, it reaches 100 Rs. Since there are only 50 sellers for 100 Rs, only 50 buyers will be able to buy the script once this price is reached. As for the other 50 buyers, they’ll have to wait until more sellers become available.",
    "metadata": {
      "source_url": "https://www.angelone.in/support/your-orders/limit-order",
      "source_filename": "support_your-orders_limit-order",
      "page_title": "Comprehensive Support for Limit Orders | Angel One",
      "section_title": "Limit order",
      "chunk_type": "paragraph"
    }
  }
]